# Level Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..Level Property
DuctPressureDropData Class See Also
---
The calculation level of the system.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public SystemCalculationLevel Level { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Level As SystemCalculationLevel
	Get
```

Visual C++
---
```text
public:
property SystemCalculationLevel Level {
	SystemCalculationLevel get ();
}
```

# Remarks
If the calculation level is Flow, all parameters that need friction will be displayed as "Not Computed" in Properties dialog (Friction, Pressure Drop, Loss Coefficient). If the calculation level is None, all parameters that need flow will be displayed as "Not Computed" in Properties dialog (Velocity, Velocity Pressure, Reynolds number, Friction, Pressure Drop, Loss Coefficient). If the calculation level is All, all parameters will be displayed with their actual values in Properties dialog.
# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace